cases/old/fsi-flap/fluid/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Channel: x=[0,1] m, y=[0,0.4] m, z=[0,0.01] m (2D, 1 cell in z)
// Bar slot: x=[0.45,0.55], y=[0,0.2] — bar lives in solid domain
// 5 blocks required so that interface patch faces align with bar height y=0.2
//
//  y=0.4 +-------[1b]------+--[2]--+------[3b]-------+
//        |                 |       |                  |
//  y=0.2 +-------[1b]------+       +------[3b]--------+
//        |                 |  BAR  |                  |
//        +-------[1a]------+       +------[3a]--------+
//  y=0   +-------[1a]------+-------+------[3a]--------+
//       x=0             x=0.45   x=0.55              x=1

scale   1;

vertices
(
    // z = 0 plane
    (0      0    0)    // 0
    (0.45   0    0)    // 1
    (0.45   0.2  0)    // 2
    (0      0.2  0)    // 3
    (0      0.4  0)    // 4
    (0.45   0.4  0)    // 5
    (0.55   0    0)    // 6
    (0.55   0.2  0)    // 7
    (0.55   0.4  0)    // 8
    (1      0    0)    // 9
    (1      0.2  0)    // 10
    (1      0.4  0)    // 11

    // z = 0.01 plane
    (0      0    0.01) // 12
    (0.45   0    0.01) // 13
    (0.45   0.2  0.01) // 14
    (0      0.2  0.01) // 15
    (0      0.4  0.01) // 16
    (0.45   0.4  0.01) // 17
    (0.55   0    0.01) // 18
    (0.55   0.2  0.01) // 19
    (0.55   0.4  0.01) // 20
    (1      0    0.01) // 21
    (1      0.2  0.01) // 22
    (1      0.4  0.01) // 23
);

blocks
(
    // Block 1a: left of bar, lower half  x=[0,0.45] y=[0,0.2]
    hex (0 1 2 3 12 13 14 15) (45 20 1) simpleGrading (1 1 1)

    // Block 1b: left of bar, upper half  x=[0,0.45] y=[0.2,0.4]
    hex (3 2 5 4 15 14 17 16) (45 20 1) simpleGrading (1 1 1)

    // Block 2: above bar                 x=[0.45,0.55] y=[0.2,0.4]
    hex (2 7 8 5 14 19 20 17) (10 20 1) simpleGrading (1 1 1)

    // Block 3a: right of bar, lower half x=[0.55,1] y=[0,0.2]
    hex (6 9 10 7 18 21 22 19) (45 20 1) simpleGrading (1 1 1)

    // Block 3b: right of bar, upper half x=[0.55,1] y=[0.2,0.4]
    hex (7 10 11 8 19 22 23 20) (45 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0  3  15 12)  // Block 1a left face  y=[0,0.2]
            (3  4  16 15)  // Block 1b left face  y=[0.2,0.4]
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (9  21 22 10)  // Block 3a right face y=[0,0.2]
            (10 22 23 11)  // Block 3b right face y=[0.2,0.4]
        );
    }

    top
    {
        type wall;
        faces
        (
            (4  16 17 5)   // Block 1b top face
            (5  17 20 8)   // Block 2  top face
            (8  20 23 11)  // Block 3b top face
        );
    }

    // Coupling patch: faces of the fluid domain that touch the bar.
    // Must be listed BEFORE bottom so that bottom's fixedValue(0) overrides
    // the preCICE displacement at the 4 shared corner points at y=0
    // (the clamped base of the bar), preventing a spurious gap there.
    interface
    {
        type wall;
        faces
        (
            (2  14 13 1)   // Block 1a right face = left side of bar  y=[0,0.2]
            (7  19 14 2)   // Block 2  bottom face = top of bar
            (6  18 19 7)   // Block 3a left face  = right side of bar y=[0,0.2]
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (1  13 12 0)   // Block 1a bottom face  x=[0,0.45]
            (9  21 18 6)   // Block 3a bottom face  x=[0.55,1]
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0  3  2  1)   // Block 1a z=0
            (3  4  5  2)   // Block 1b z=0
            (2  5  8  7)   // Block 2  z=0
            (6  7  10 9)   // Block 3a z=0
            (7  8  11 10)  // Block 3b z=0
            (12 13 14 15)  // Block 1a z=0.01
            (15 14 17 16)  // Block 1b z=0.01
            (14 19 20 17)  // Block 2  z=0.01
            (18 21 22 19)  // Block 3a z=0.01
            (19 22 23 20)  // Block 3b z=0.01
        );
    }
);
