cases/old/fsi-flap/fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

// preCICE adapter configuration for pimpleFoam (fluid participant)

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
    Interface1
    {
        mesh              Fluid-Mesh;
        patches           (interface);
        locations         faceCenters;

        readData
        (
            Displacement
        );

        writeData
        (
            Force
        );
    }
}

FSI
{
    solverType          incompressible;
    // Fluid density for force computation (water)
    rho rho [1 -3 0 0 0 0 0] 1000;
}
